package MYDLjE::I18N::bg;
use base 'MYDLjE::I18N';
use strict;
use warnings;
use utf8;

our %Lexicon = (    ##no critic qw(Variables::ProhibitPackageVars)
  _AUTO => 1,

  #cpanel/loginscreen.html.tt
  Login          => 'Вписване',
  Logout         => 'Изход',
  Help           => 'Помощ',
  login_name     => 'Потребител',
  login_password => 'Парола',
  login_name_help =>
    'Моля въведете Вашето потребителско име за приложението MYDLjE::ControlPanel!',
  login_password_help =>
    'Моля въведете Вашата парола. Тя е защитена дори ако не ползвате HTTPS протокола!',
  login_field_error =>
    'Моля въведете валидна стойност за полето "[_1]"!',
  first_name => 'Име',
  last_name  => 'Фамилия',
  email      => 'Е-поща',
  session_id_error =>
    'Невалидна сесия. Моля опитайте отново!',

  #Main left menu items
  #main_left_navigation.html.tt
  Content             => 'Съдържание',
  Pages               => 'Страници',
  Books               => 'Книги',
  Articles            => 'Статии',
  Questions           => 'Въпроси',
  Notes               => 'Бележки',
  'I18N&L10N'         => 'I18N&L10N',
  list_pages          => 'Списък със страници',
  list_questions      => 'Списък с въпроси',
  list_answers        => 'Списък с отговори',
  list_articles       => 'Списък със статии',
  list_notes          => 'Списък с бележки',
  list_books          => 'Списък с книги',
  list_list           => 'Списък с всякакво съдържание',
  'New [_1]'          => 'Нов запис ([_1])',
  'Edit [_1]'         => 'Редакция на ([_1])',
  page                => 'Страница',
  book                => 'Книга',
  article             => 'Статия',
  chapter             => 'Глава',
  question            => 'Въпрос',
  answer              => 'Отговор',
  note                => 'Бележка',
  brick               => 'Тухла',
  list_bricks         => 'Тухли',
  Bricks              => 'Тухли',
  Stores              => 'Магазини',
  Merchants           => 'Търговци',
  Products            => 'Продукти',
  'Rules and Coupons' => 'Правила и Купони',
  user                => 'Потребител',

  #MYDLjE::M::Content fields
  title => 'Заглавие/Име',
  title_help =>
    'Всяко съдържание в MYDLjE има заглавие. То се показва в тага "title". '
    . 'Възможно е да се показва и като заглавие(таг h1) в тялото на страницата. '
    . 'Когато е заглавие на домейн, '
    . 'по подразбиране се показва в заглавната част на всяка страница',
  alias      => 'Псевдоним',
  alias_help => <<"AA"
Псевдонимът е уникален идентификатор за съдържание от даден тип. Обикновено се генерира
автоматично. Страниците също имат псевдоними, но те са уникални за домейна на страницата.
AA
  ,
  tags        => 'Етикети',
  featured    => 'Препоръчано',
  sorting     => 'Подредба',
  data_type   => 'Тип',
  data_format => 'Формат',
  data_format_help =>

    'Съдържанието в MYDLjE може да бъде съхраявано в различни текстови формати '
    . '(езици за маркиране): *html*, *text*, *textile*, *markdown*, *pod*, *template*. '
    . 'Форматът обозначава по какъв начин ще бъде обработено съдържанието преди '
    . 'да се покаже на потребителите в сайта. ' . "\n\n"
    . 'bq. HTML: Ще бъде превърнат във валиден XHTML и показан.'
    . "\n\n"
    . 'bq. TEXT: Ще бъде форматиран минимално. Всеки празен ред ще означава нов параграф.'
    . "\n\n"
    . 'bq. TEXTILE: Ще бъде обработен от процесора за *textile* '
    . '("Text::Textile":http://search.cpan.org/dist/Text-Textile/). '
    . 'Вижте "примери в Wikipedia":http://en.wikipedia.org/wiki/Textile_%28markup_language%29 и '
    . '"този справочник":http://redcloth.org/hobix.com/textile/.' . "\n\n"
    . 'bq. MARKDOWN: Това е друг популярен формат за маркиране на текст, подобен на предния. '
    . 'Ще бъде обработен от процесора за *markdown* '
    . '("Text::MultiMarkdown":http://search.cpan.org/dist/Text-MultiMarkdown/). Вижте "примери в '
    . 'Wikipedia":http://en.wikipedia.org/wiki/Markdown '
    . ' и "оригиналната страница за синтаксиса":http://daringfireball.net/projects/markdown/syntax/.'
    . "\n\n"
    . 'bq. POD(Plain Old Documentation): Формат, '
    . 'използван за писане на документация за програми на езика за програмиране Perl. '
    . 'Може спокойно да бъде ползван за всякакъв вид структуриран текст. '
    . 'Вижте "perlpod":http://perldoc.perl.org/perlpod.html и'
    . ' "спецификацията":http://perldoc.perl.org/perlpodspec.html.'
    . "\n\n"
    . 'bq. TEMPLATE(Template::Toolkit): Това е мини език за програмиране на шаблони, '
    . 'използван от MYDLjE. '
    . 'Използвайте този формат, за да пишете мини-програми директно в страниците. '
    . 'MYDLjE използва имплементацията '
    . '"Template::Alloy::TT":http://search.cpan.org/dist/Template-Alloy/lib/Template/Alloy/TT.pm.'
    . ' Вижте също "оригиналната страница за синтаксиса"'
    . ':http://template-toolkit.org/docs/manual/Syntax.html. '
    . ' За да използвате максимално възможностите на шаблоните, трябва да знаете как работи MYDLjE.'
    . "\n\n",

  time_created => 'Време на създаване',
  tstamp       => 'Време на Промяна',
  body         => 'Съдържание (тяло)',
  invisible    => 'Невидимо',
  language     => 'Език',
  language_help =>
    'Всеки елемент съдържание се пише на даден език. '
    . 'Изберете езика, на който ще бъде текущото съдържание. '
    . "\n\n"
    . 'За страниците това е езика (по подразбиране) за заглавието и тялото. '
    . 'Една страница може да съдържа елементи на различни езици.',
  group_id  => 'Група',
  protected => 'Защитено',
  bad       => 'Лошо',

  #TODO: use I18N::LangTags::List better
  bg => 'Български',
  en => 'Английски',

  Site    => 'Сайт',
  Domains => 'Домейни',
  Domain  => 'Домейн',
  domain_help =>
    'В MYDLjE могат да се управляват няколко домейна. Всеки домейн има свои страници. '
    . 'По този начин можете да хоствате няколко "сайта" само с една сметка при някой доставчик '
    . 'на хостинг услуги, като ползвате само една инсталация на MYDLjE.',
  Templates       => 'Шаблони',
  Accounts        => 'Сметки',
  Users           => 'Потребители',
  Groups          => 'Групи',
  Abilities       => 'Умения',
  System          => 'Система',
  Settings        => 'Настройки',
  Cache           => 'Кеш',
  Plugins         => 'Добавки',
  Log             => 'Отчет',
  Files           => 'Файлове',
  Preferences     => 'Предпочитания',
  order_by        => 'Подредба по',
  order           => 'Ред',
  ASC             => 'Възходящ',
  DESC            => 'Низходящ',
  'Please select' => 'Моля, изберете',
  'All types'     => 'Всички типове',
  'All languages' => 'Всички езици',
  page_id         => 'Страница',
  page_id_help =>
    'Страница, в която се намира този запис.',

#page_types
  page_type => 'Тип Страница',
  page_type_help =>
    'MYDLjE поддържа различни типове страници. ' . "\n\n"
    . 'bq. *Индексната (начална) страница* е входната точка към домейна. '
    . 'Тя се показва, когато в уеб-адреса не е дефинирана друга страница.'
    . $/
    . $/
    . 'bq. В *обикновената страница* може да слагате всякакъв тип съдържание. '
    . 'MYDLjE обхожда съдържанието и го показва в зависимост от неговия тип. '
    . "\n\n"
    . 'bq. *Папката* служи само за съхранение на записи съдържание или записи от други таблици.',
  default          => 'Страница-индекс на домейн',
  regular          => 'Обикновена',
  folder           => 'Папка',
  description      => 'Описание',
  description_help => 'Използва се в META-тага "description". '
    . 'Интернет-търсачките го четат при индексиране на сайта.',
  permissions => 'Права',
  permissions_help =>
    'Определя кой има право да редактира записа. '
    . "\n\n"
    . 'Първият символ показва дали записът съдържа други записи в себе си, '
    . 'дали е връзка към други записи в същата таблица, или пък е обикновен запис. '
    . 'Когато записът е връзка към друг запис, в сайта ще се покаже/изпълни тялото на записа,'
    . 'чиито идентификатор(id) е посочен в тялото на записа-връзка.'
    . "\n\n"
    . 'Следващите *три* символа определят правата на собственика на записа. '
    . '*Втората* тройка символи определят правата на групата, на която принадлежи записът. '
    . '*Третата* група символи определя правата на всички останали.',
  pid => 'Намира се в',
  pid_help =>
    'Всеки елемент съдържание има родителски елемент (в същата таблица), '
    . 'в който може да бъде поставен. '
    . 'Така се изграждат гъвкави иерархични структури:'
    . "\n\n"
    . '* Книгите имат глави, в главите има коментари и бележки;'
    . $/
    . '* Въпросите имат отговори. Отговорите и въпросите могат да имат бележки и коментари;'
    . $/
    . '* Статиите имат бележки'
    . $/
    . '* Страниците от таблица "pages" се намират в други страници. '
    . 'Така се изграждат основното меню и картата на сайта;'
    . $/,
  sorting      => 'Подредба',
  sorting_help => '-',
  template     => 'шаблон',
  template_help =>
    'TT2-програмен код за показване на страницата. '
    . 'Използва се шаблона по подразбиране ако нищо не е указано.',
  hidden => 'Скрита',
  hidden_help =>
    'Страницата няма да се показва в списъци и менюта, '
    . 'но може да бъде отваряна ако е публикувана. Трябва ръчно да създадете връзка към нея.',
  published        => 'Публикувано',
  'not published'  => 'Не е публикувано',
  'waiting review' => 'Очаква одобрение',
  published_help =>
    'Само *публикувани* страници и съдържание се показват в сайта. ',
  cache => 'Да се кешира',
  cache_help =>
    'Когато съдържанието на една страница не се променя често, няма нужда всеки път, '
    . 'когато се показва в браузъра, да я зареждаме от базата данни и сглобяваме наново. '
    . 'Можем да я запазим в готов вид, като само я показваме на посетителите.',
  expiry => 'Изтича след',
  expiry_help =>
    'Времето в секунди, след което кешът на страницата ще изтече, ако страницата се кешира '
    . '(по подразбиране - 86400 = 24 часа).',
  body_help =>
    'Главно съдържание. В зависимост от стойността на полето "[_1]", '
    . 'съдържанието се интерпретира по съответния начин.',
  'Record Type'    => 'Тип запис',
  'Regular Record' => 'Обикновен запис',
  Link             => 'Връзка към запис',
  Container        => 'Съдържа други записи',
  delete_domain_confirm_message =>
    'Сигурни ли сте, че искате да изтриете домейна "[_1]"? '
    . 'Това ще изтрие всички страници и съдържание в него! Всичко ще бъде загубено завинаги!',
  delete_page_confirm_message =>
    'Сигурни ли сте, че искате да изтриете страницата "[_1]"? '
    . 'Това ще изтрие също всички под-страници и съдържанието в тях! Всичко ще бъде загубено завинаги!',
  Save             => 'Запис',
  'Save and close' => 'Запис и затваряне',
  Reset            => 'Нулиране',
  box              => 'Кутия',
  in_box           => 'в кутия "[_1]"',
  box_help =>
    'Всяка страница в MYDLjE се състои от "Кутии". '
    . 'Въведете името на кутията, в която искате да се показва този елемент. '
    . 'По подразбиране всички елементи съдържание се поставят в кутията "MAIN_AREA".'
    . ' Кутиите са дефинирани в "layouts/${DOMAIN.id}/pre_process.tt".',
  user_description_help =>
    'Няколко думи за потребителя от самия него - до 255 символа.',
  created_by => 'Създаден от',
  created_by_help =>
    'Кой е създал потебителя? Ако това е "гост", то този потребител се е регистрирал през сайта.',
  changed_by      => 'Променен от',
  changed_by_help => 'Кой за последно е променял записа?,',
  tstamp          => 'Последна промяна',
  reg_tstamp      => 'Регистрация',
  disabled        => 'Заключен',

);

1;
